var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "鲍嘉铭",
    sex: "男",
    age: "23",
    phone: "15385388278",
    email: "baojiaminger@163.com",
    address: "现居北京市北京邮电大学",
    qq: "1091058266",
    log: "Benjamin",
    excpect_work: "Java/Go后端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "老当益壮，宁移白首之心；穷且益坚，不坠青云之志。",
        "悟已往之不谏，知来者之可追。",
        "曾记否，到中流击水，浪遏飞舟？",
        "人生如梦，一尊还酹江月。",
        "竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。",
        "试问岭南应不好，却道：此心安处是吾乡。",
        "我欲将心向明月，奈何明月照沟渠。",
        "雪沫乳花浮午盏，蓼茸蒿笋试新盘，人间有味是清欢。",
        "雄关漫道真如铁，而今迈步从头越。",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "天生我材必有用，千金散尽还复来。",
        "满堂唯有烛花红，杯且从容，歌且从容。",
        "纸上得来终觉浅，绝知此事要躬行。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "北海虽赊，扶摇可接<br>" +
             "东隅已逝，桑榆非晚<br>" +
             "你好，我是鲍嘉铭，一名来自北京邮电大学的24应届毕业生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫鲍嘉铭，性别男，北邮信管（二学位）专业大四在读。我期望的工作岗位是Go/Java后端开发。</p>" +
        "<p>我有着较多的编程经验，计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当！</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["Java", 80, "red"],
        ["GoLang", 77, "blue"],
        ["SQL", 75, "#1abc9c"],
        ["CPP", 80, "rgba(150,50,150)"],
        ["Python", 60, "yellow"],
        ["C#", 60, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>操作系统、计算机网络等编程基础知识良好。</li>" +
        "     <li>熟练掌握Java基础。</li>" +
        "     <li>熟悉JavaIO、多线程、集合等基础框架。</li>" +
        "     <li>了解JVM原理。</li>" +
        "     <li>熟悉Go语言开发基本知识。</li>" +
        "     <li>熟悉SQL语句编写以及调优。</li>" +
        "     <li>熟悉基本Linux命令操作。</li>" +
        "     <li>熟悉Spring、ibatis、struts等框架的使用，了解其原理与机制。</li>" +
        "     <li>熟悉缓存、消息等机制。</li>" +
        "     <li>了解分布式系统的设计与应用。</li>" +
        "     <li>了解CPP基础知识，拥有CPP开发经验。</li>" +
        "     <li>了解C#基础知识，拥有Unity游戏测试开发经验。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.png", "https://blog.csdn.net/Void_papaya/article/details/128611584", "删除链表的倒数第 N 个结点", "快慢指针解法<br>二轮扫描解法<br>时间复杂度解析"],
        ["./images/pro-2.png", "https://blog.csdn.net/Void_papaya/article/details/128606914", "合并k个升序链表", "优先队列解法<br>分治合并解法<br>时间复杂度解析"],
        ["./images/pro-3.png", "https://blog.csdn.net/Void_papaya/article/details/128631847", "反转链表（区间）", "递归解法<br>迭代解法<br>时间复杂度分析"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2021/7/1 — 2021/8/10", "<br>网络开发实习生",
            "<p><strong>中兴燕郊科技园</strong></p>" +
            "<p>曾于中兴燕郊科技园参与实习学习活动，参与了机房管理，网络拓扑调整优化工作，进一步学习了路由网络知识，巩固了计算机网络技术基础。</p>" 
        ],

        ["2023/4/1 — 2023/7/1", "<br>游戏测试开发实习生",
            "<p><strong>FUNPLUS长缨游戏工作室</strong></p>" +
            "<p>曾于北京FUNPLUS公司长缨游戏工作室担任游戏测试开发实习生，积极完成项目任务，圆满完成开发周期任务，学习了诸多测试开发知识。</p>" 
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2018-09-01~2022-07-01", "北京邮电大学计算机学院", "就读于北邮计算机学院计算机科学与技术专业，勤奋学习，积极创新，顺利完成学业。"],
        ["2018-10-01~2020-07-01", "学生工作", "大一大二积极参与班级工作，担任大班文艺体育委员，组织了至少三次200人以上的大型文体活动。"],
        ["2019-04-01~2023-07-01", "英语六级", "大学期间分别以516分和473分的成绩通过了全国大学生英语四六级考试。"],
        ["2022-09-01~2024-07-01", "北京邮电大学经济管理学院", "就读于北邮经管院信息管理与信息系统（二学位）专业，勤奋学习，积极创新，顺利完成学业。"],
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     */
    icon: [
        ["./svg/LeetCode.svg", "https://leetcode.cn/u/benjamin_bjm/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/Bao-JM", "我的GitHub主页"],
        ["./svg/csdn.svg", "https://blog.csdn.net/Void_papaya?spm=1010.2135.3001.5343", "我的个人博客"],
        ["./svg/小红书.svg", "https://www.xiaohongshu.com/user/profile/642e55220000000012010aa9", "我的小红书主页"],
        ["./svg/知乎.svg", "https://www.zhihu.com/people/luan-ru-shi-feng", "我的知乎主页"]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}